/*
Задача 52. Задайте двумерный массив из целых чисел. 
Найдите среднее арифметическое элементов в каждом столбце.

Например, задан массив:
1 4 7 2
5 9 2 3
8 4 2 4
Среднее арифметическое каждого столбца: 4,6; 5,6; 3,6; 3
*/


int[,] array =
{
    {5, 8, 3, 1, 9, 0},
    {7, 4, 6, 5, 1, 1},
    {9, 0, 6, 5, 3, 3}
};
for (int i = 0; i < array.GetLength(1); i++)
{
    double summa = 0;
    for (int j = 0; j < array.GetLength(0); j++)
    {
        summa += array[j, i];
    }
    Console.WriteLine($"Среднее арифметическое {i + 1} столбца {Math.Round((summa / array.GetLength(0)), 1)}");
}